//Определить количество цифр в числе

Console.Clear();
Console.WriteLine("Введите число: ");
int A = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(Convert.ToString(A).Length);